# Pandas 2

In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
# import statements
import pandas as pd
from pandas import Series, DataFrame

## Series recap

In [3]:
s = Series({"Alice": 6, "Bob": 7, "Cindy": 8, "Dan": 9})
s

Alice    6
Bob      7
Cindy    8
Dan      9
dtype: int64

### Data lookup
- s.loc[X]   <- lookup by pandas index
- s.iloc[X]  <- lookup by integer position
- s[X]       <- depends (first try index, use integer position if necessary)

In [4]:
s.loc["Bob"] #Series index

7

In [5]:
s.iloc[2] #Series integer position

8

In [6]:
s["Cindy"] #Series index

8

In [7]:
#No conflict between index and integer position in this example!
s[1] #Series integer position

7

### Insert new index-value pair

In [8]:
s["Meena"] = 10
s

Alice     6
Bob       7
Cindy     8
Dan       9
Meena    10
dtype: int64

### Data alignment review (element-wise operation: series op series)

In [9]:
x = Series({"A": 10, "B": 100})
s1 = Series({"A": 2, "B": 3})
s2 = Series({"B": 3, "A": 2})
print(x)
print(s1)
print(s2)

A     10
B    100
dtype: int64
A    2
B    3
dtype: int64
B    3
A    2
dtype: int64

### What is x * s1?

In [10]:
print(x)
print(s1)
x * s1

A     10
B    100
dtype: int64
A    2
B    3
dtype: int64

A     20
B    300
dtype: int64

### What is x * s2?

In [11]:
print(x)
print(s2)
x * s2

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A     20
B    300
dtype: int64

### What is x < s1?

In [12]:
print(x)
print(s1)
x < s1

A     10
B    100
dtype: int64
A    2
B    3
dtype: int64

A    False
B    False
dtype: bool

### What is x < s2?

In [13]:
print(x)
print(s2)
# x < s2 #ValueError because of data not being aligned!

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

### Oops, let's try series.lt(series)

In [14]:
print(x)
print(s2)
x.lt(s2) # lt is less than

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A    False
B    False
dtype: bool

### How would you apply greater than?

In [15]:
print(x)
print(s2)
x.gt(s2) # greater than

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A    True
B    True
dtype: bool

### What about equal comparison?

In [16]:
print(x)
print(s2)
x.eq(s2) # equal

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A    False
B    False
dtype: bool

### ge (>=), le (<=), and ne (!=) are the other options

In [17]:
print(x)
print(s2)
x.ge(s2) # greater than or equal

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A    True
B    True
dtype: bool

In [18]:
print(x)
print(s2)
x.le(s2) # less than or equal

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A    False
B    False
dtype: bool

In [19]:
print(x)
print(s2)
x.ne(s2) # not equal

A     10
B    100
dtype: int64
B    3
A    2
dtype: int64

A    True
B    True
dtype: bool

### Can we fix the ordering of s2 series?
### Try series.sort_index()

In [20]:
print(s2)
s2_sorted = s2.sort_index()
s2_sorted

B    3
A    2
dtype: int64

A    2
B    3
dtype: int64

## Boolean indexing
- applying boolean expressions on a Series
- boolean expression will be specified within the pair of [  ]
- Boolean operators:
    - & means 'and'
    - | means 'or'
    - ~ means 'not'
    - we must use () for compound boolean expressions

In [21]:
# Modified from https://automatetheboringstuff.com/chapter14/
import csv
def process_csv(filename):
    example_file = open(filename, encoding="utf-8")
    example_reader = csv.reader(example_file)
    example_data = list(example_reader)
    example_file.close()
    return example_data

data = process_csv("cs220_survey_data.csv")
header = data[0]
data = data[1:]

# use list comprehension to extract just ages
age_list = [int(row[header.index("age")]) for row in data if row[header.index("age")] != ""]

cs220_ages = pd.Series(age_list)

### How many students are 25 years or older?

In [22]:
cs220_ages > 25

0      False
1      False
2      False
3      False
4      False
       ...
877    False
878    False
879    False
880    False
881    False
Length: 882, dtype: bool

In [23]:
cs220_ages[cs220_ages > 25]

38     32
93     46
169    30
170    35
173    29
266    28
369    28
409    27
479    26
495    31
669    26
686    26
696    30
698    34
732    29
756    26
786    27
790    37
794    28
804    33
dtype: int64

In [24]:
print(len(cs220_ages[cs220_ages > 25]))

20

### How many students are in the age range 18 to 20, inclusive?

In [25]:
(cs220_ages >= 18) & (cs220_ages <= 20)

0       True
1       True
2       True
3       True
4       True
       ...
877     True
878     True
879    False
880     True
881     True
Length: 882, dtype: bool

In [26]:
cs220_ages[(cs220_ages >= 18) & (cs220_ages <= 20)]

0      19
1      18
2      19
3      19
4      19
       ..
876    19
877    19
878    20
880    19
881    18
Length: 682, dtype: int64

In [27]:
len(cs220_ages[(cs220_ages >= 18) & (cs220_ages <= 20)])

682

## DataFrame can be created from:
1. dict of Series
2. dict of lists
3. list of lists
4. dict of dicts
5. list of dicts

### DataFrame from dictionary of Series

In [28]:
col1 = Series(["Alice", "Bob", "Cindy", "Dan"])
col2 = Series([6, 7, 8, 9])
DataFrame({
    "Player name": col1,
    "Score": col2
})

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### DataFrame from dictionary of lists

In [29]:
DataFrame({
    "Player name": ["Alice", "Bob", "Cindy", "Dan"],
    "Score": [6, 7, 8, 9]
})

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### DataFrame from list of lists

In [30]:
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
DataFrame(data)

       0  1
0  Alice  6
1    Bob  7
2  Cindy  8
3    Dan  9

### DataFrame from dictionary of dicts

In [31]:
data = {
    "Name": {0: "Alice", 1: "Bob", 2: "Cindy", 3: "Dan"},
    "Score": {0: 6, 1: 7, 2: 8, 3: 9}
}

DataFrame(data)

    Name  Score
0  Alice      6
1    Bob      7
2  Cindy      8
3    Dan      9

In [32]:
data = {
    "Name": {"A": "Alice", "B": "Bob", "C": "Cindy", "D": "Dan"},
    "Score": {"A": 6, "B": 7, "C": 8, "D": 9}
}

DataFrame(data)

    Name  Score
A  Alice      6
B    Bob      7
C  Cindy      8
D    Dan      9

### DataFrame from list of dicts

In [33]:
data = [
    {"Player name": "Alice", "Score": 6},
    {"Player name": "Bob", "Score": 7},
    {"Player name": "Cindy", "Score": 8},
    {"Player name": "Dan", "Score": 9}
]
DataFrame(data)

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Renaming the row index
- <i>index</i> parameter takes a list of row indexes as argument
- <i>columns</i> parameter takes a list of column indexes as argument

In [34]:
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
df = DataFrame(data, index = ["A", "B", "C", "D"], columns = ["Player name", "Score"])
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

## Data lookup

### Series
- s.loc[X]   <- lookup by pandas index
- s.iloc[X]  <- lookup by integer position
- s[X]       <- depends (first try index, use integer position if necessary)

### DataFrame
- d.loc[X]    <- lookup ROW by pandas ROW index
- d.iloc[X]   <- lookup ROW by ROW integer position
- d[X]        <- lookup COL by COL index
- d.loc[X, Y] <- lookup by ROW index and COL index
- d.iloc[X, Y] <- lookup by ROW integer position and COL integer position

In [35]:
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

In [36]:
df.loc["A"] #ROW INDEX

Player name    Alice
Score              6
Name: A, dtype: object

In [37]:
type(df.loc["A"])

pandas.core.series.Series

In [38]:
df.iloc[1] #ROW INTEGER POSITION

Player name    Bob
Score            7
Name: B, dtype: object

In [39]:
df.iloc[-1] #ROW INTEGER POSITION

Player name    Dan
Score            9
Name: D, dtype: object

In [40]:
df["Score"] #COLUMN INDEX

A    6
B    7
C    8
D    9
Name: Score, dtype: int64

In [41]:
#df["A"]  #KeyError

In [42]:
df.loc["B", "Player name"] # ROW INDEX, COL INDEX

'Bob'

In [43]:
df.loc["B", "Score"] # ROW INDEX, COL INDEX

7

In [44]:
df.iloc[-1, 0] # ROW Integer position, COL Integer position

'Dan'

### How to set values for a specific entry?

- d.loc[X, Y] = new_val <- set value by ROW INDEX and COL INDEX
- d.iloc[X, Y] = new_val <- set value by ROW Integer position and COL Integer position

In [45]:
df.loc["B", "Score"] = 12
df

  Player name  Score
A       Alice      6
B         Bob     12
C       Cindy      8
D         Dan      9

In [46]:
df.loc["B", "Score"] += 3
df

  Player name  Score
A       Alice      6
B         Bob     15
C       Cindy      8
D         Dan      9

In [47]:
df.iloc[-1, 1] += 2
df

  Player name  Score
A       Alice      6
B         Bob     15
C       Cindy      8
D         Dan     11

### How to compute max score?

In [48]:
df["Score"].max()

15

### How to compute mean score?

In [49]:
df["Score"].mean()

10.0

### Slicing DataFrame

- df.iloc[ROW_SLICE, COL_SLICE] <- take a rectangular slice from the DataFrame using integer positions
- df.loc[ROW_SLICE, COL_SLICE] <- take a rectangular slice from the DataFrame using index

In [50]:
df.iloc[1:3, 1:]

   Score
B     15
C      8

In [51]:
df.iloc[1:3, :]

  Player name  Score
B         Bob     15
C       Cindy      8

In [52]:
df.loc["B":"C", :]

  Player name  Score
B         Bob     15
C       Cindy      8

## How to set values for sliced DataFrame?

- d.loc[ROW_SLICE, COL_SLICE] = new_val <- set value by ROW INDEX and COL INDEX
- d.iloc[ROW_SLICE, COL_SLICE] = new_val <- set value by ROW Integer position and COL Integer position

In [53]:
df

  Player name  Score
A       Alice      6
B         Bob     15
C       Cindy      8
D         Dan     11

In [54]:
df.loc["B":"C", "Score"] += 5
df

  Player name  Score
A       Alice      6
B         Bob     20
C       Cindy     13
D         Dan     11

## Instead of a slice, you could use a list of indexes or integer positions.

In [55]:
df.loc[["B", "D"], "Player name"]

B    Bob
D    Dan
Name: Player name, dtype: object

In [56]:
df.loc[["B", "D"], "Score"] += 2

## Boolean indexing

### Series
- s[BOOL SERIES]  <- gets all s values lined up with True

### DataFrame
- d[BOOL SERIES]  <- pulls out rows lined up with True

In [57]:
df

  Player name  Score
A       Alice      6
B         Bob     22
C       Cindy     13
D         Dan     13

In [58]:
df["Score"]

A     6
B    22
C    13
D    13
Name: Score, dtype: int64

In [59]:
b = df["Score"] >= 15
b

A    False
B     True
C    False
D    False
Name: Score, dtype: bool

In [60]:
df[b]

  Player name  Score
B         Bob     22

## Creating DataFrame from csv
- read_csv function

In [61]:
df = pd.read_csv("IMDB-Movie-Data.csv")
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

### How to see first few lines of the DataFrame?

In [62]:
df.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [63]:
df.head(2)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M

### How to see last few lines of the DataFrame?

In [64]:
df.tail()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [65]:
df.tail(3)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [66]:
df["Year"]

0      2014
1      2012
2      2016
3      2016
4      2016
       ...
993    2015
994    2007
995    2008
996    2014
997    2016
Name: Year, Length: 998, dtype: int64

In [67]:
df["Rating"]

0      8.1
1      7.0
2      7.3
3      7.2
4      6.2
      ...
993    6.2
994    5.5
995    6.2
996    5.6
997    5.3
Name: Rating, Length: 998, dtype: float64

### Notice that there are two index columns
- That happened because when you write a csv from pandas to a file, it writes a new index column
- So if the dataFrame already contains an index, you are going to get two index columns
- Let's fix that problem

### How can you use slicing to get rid of the first column?

In [68]:
better = df.iloc[:, 1:]
better.head()

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

### Wrong way to write a df to a csv file

In [69]:
better.to_csv("wrong_movies.csv")

### Correct way to write a df to a csv file

In [70]:
better.to_csv("better_movies.csv", index = False)

### What is the highest rated movie that had an above average runtime?

In [71]:
df = better
df["Runtime"]

0      121
1      124
2      117
3      108
4      123
      ...
993    111
994     94
995     98
996     93
997     87
Name: Runtime, Length: 998, dtype: int64

#### Step 1. Determine average runtime of all movies

In [72]:
df["Runtime"].mean()

113.17034068136273

#### Step 2. Extract movies that have above average runtime
1. write boolean expression
2. apply boolean expression to the original DataFrame

In [73]:
b = df["Runtime"] > df["Runtime"].mean()
b

0       True
1       True
2       True
3      False
4       True
       ...
993    False
994    False
995    False
996    False
997    False
Name: Runtime, Length: 998, dtype: bool

In [74]:
long_movies = df[b]
long_movies.head()

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M

Steps 2.1 and 2.2 could be combined easily

In [75]:
long_movies = df[ df["Runtime"] > df["Runtime"].mean()]
long_movies.head()

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M

#### Step 3. Find movie with highest rating, among the movies which have above average runtime

In [76]:
long_movies["Rating"]

0      8.1
1      7.0
2      7.3
4      6.2
6      8.3
      ...
977    7.6
979    5.3
980    7.4
987    7.5
989    8.5
Name: Rating, Length: 432, dtype: float64

In [77]:
long_movies["Rating"].max()

9.0

#### Step 4. Find the movie with the highest rating
1. write boolean expression
2. apply boolean expression to the original DataFrame

In [78]:
b = long_movies["Rating"] == long_movies["Rating"].max()
b

0      False
1      False
2      False
4      False
6      False
       ...
977    False
979    False
980    False
987    False
989    False
Name: Rating, Length: 432, dtype: bool

In [79]:
long_movies[long_movies["Rating"] == long_movies["Rating"].max()]

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
54,The Dark Knight,"Action,Crime,Drama",Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,533.32

### DataFrame.describe()
- provides a lot of useful stats
- works only for columns with numbers as values

In [80]:
stats = df.describe()
stats

              Year     Runtime      Rating
count   998.000000  998.000000  998.000000
mean   2012.779559  113.170341    6.723447
std       3.207549   18.828877    0.945682
min    2006.000000   66.000000    1.900000
25%    2010.000000  100.000000    6.200000
50%    2014.000000  111.000000    6.800000
75%    2016.000000  123.000000    7.400000
max    2016.000000  191.000000    9.000000

### How to get median runtime of all the movies?

In [81]:
stats.loc["50%", "Runtime"]

111.0